[
	{"_id": 1234, 
	  "name": "uBiome SmartGut", 
	  "description": "The world’s first sequencing-based clinical microbiome test",
	  "img": "https://ubiome.com/wp-content/uploads/2017/06/ubiome.svg",
	  "categories": ["gut health", "free"],
	  "myTake": "I was amazed that I was able to get this done for free. They are basically trading their service to be able to keep the data associated with your test, which can be used to aid further research, which is great! I took this test and found out I was low on most healthy gut bacteria! I was able to use this information to help inform my diet and supplement regimine, and improve my gut health, and ultimately my overall health!",
	  "url" : "https://ubiome.com/clinical/smartgut/"
	},
	{"_id": 2222, 
	  "name": "Root Causes Clinic", 
	  "description": "Root Causes Clinic was created to offer a wider range of Functional Medicine Practitioners to people like you. Our current conventional healthcare system often falls short of finding the root causes of symptoms and silent inflammation, leaving patients with a prescription and not much else. Rather than simply masking symptoms, our practitioners use science based labs and in depth patient health discovery to do a deep dive into what may be triggering a cascade of inflammation in the patient. While many patients may be used to a quick 15 minute meeting with their doctor, our practitioners spend an entire 90 minutes during your initial consultation in order to cover all potential factors.",
	  "img": "http://i3.wp.com/rootcausesclinic.com/wp-content/uploads/2017/12/rootcausesclinicwebsitelogo.png",
	  "categories": ["webcam", "specialist"],
	  "myTake": "I met with Jade from Root Causes, and she helped understand how the absorbtion of vitamins (or lack thereof) can effect Fibromyalgia. She put me on a regimin of supplements, which have improved my health, especially my gut health. I continue to work with Jade. ",
	  "url" : "http://rootcausesclinic.com/"
	},
	{"_id": 4444, 
	  "name": "Get a Medical Cannabis Card", 
	  "description": "Migraine, fibromyalgia, IBS and related conditions display common clinical, biochemical and pathophysiological patterns that suggest an underlying clinical endocannabinoid deficiency that may be suitably treated with cannabinoid medicines. -Neuro Endocrinology Letters, 2008",
	  "img": "https://static.wixstatic.com/media/1b771c_24900d1d7ddd4042a527b57745fac913~mv2.png/v1/fill/w_170,h_170,al_c,usm_0.66_1.00_0.01/1b771c_24900d1d7ddd4042a527b57745fac913~mv2.png",
	  "categories": ["supplement", "gut health"],
	  "myTake": "Medical cannabis has helped me tremendously over the years with pain, insomnia, and even brain fog! This company is located in CA, please make sure your state has legal medical cannabis, and will accept a CA issued recommendation.",
	  "url" : "http://www.nuggmd.com/"
	},
	{"_id": 5555, 
	  "name": "Holistic Pain Treatment with Dr. Lei", 
	  "description": "Developer of Source Technique, Dr. Lei has been a pioneer in the Chiropractic world, bridging the structural with the emotional and chemical issues that often lie beneath physical pain and dysfunction.  While a student at Northwestern University, Dr. Lei studied biomedical engineering, and while playing Division I collegiate soccer, she gained first-hand experience with the treatment of sports injuries. Graduating as valedictorian with top honors from Life Chiropractic College West, she was a guest teacher for doctoral level classes on several occasions. ",
	  "img": "http://www.reclaimhealth.org/images/navLogo.gif",
	  "categories": ["webcam"],
	  "myTake": "Dr. Lei helped me make my first big leap to better health, by working with me in relation to gut health as well as mental health. I credit Dr. Lei with helping me to truly take responsibility for my own health, and to see the connection between spiritual/ emotional health and physical health.",
	  "url" : "http://www.reclaimhealth.org/"
	},
	{"_id": 1984, 
	  "name": "Life Coaching with Alex White", 
	  "description": "As someone who has battled Fibromyalgia for most of my life, I've long lived with daily pain, fatigue, digestion issues, brain fog, associated depression and anxiety, and a restrictive diet. I've learned that in order to improve my quality of life, I've had to reorganize my life to deal with these issues. I can help you do the same.",
	  "img": "/images/profile2018.png",
	  "categories": ["webcam"],
	  "myTake": "",
	  "url" : "https://www.smile.amazon.com"
	}]