[
	{
		"timestamp": "2018-06-11T19:17:14.974Z",
		"title": "How to Heal Your Gut",
		"content": "<p>It's been a long road to a healthy gut for me, and one that fortunately has taken me to one of the largest health and quality of life improvements I've experienced in my life. On its own, gut health is incredibly important, as our ability to break down nutrients from our food is one of the pillars of our well being, along with a healthy heart, healthy mind, and healthy elimination. &nbsp;</p>\n<p><br></p>\n<p>Fibromyalgia is closely tied to Gut Health. In fact according to multiple sources, a majority of people with fibromyalgia also have Leaky Gut Syndrome, Irritable Bowel Syndrome, or at least chronic bowel discomfort.&nbsp;</p>\n<p><br></p>\n<p>While the mechanisms of cause and affect may not be well understood, two things are certain:&nbsp;</p>\n<p><br></p>\n<ol>\n  <li>Gut health is extremely important to overall health&nbsp;</li>\n  <li>Life is much improved with a healthy gut.&nbsp;</li>\n</ol>\n<h3>What is a healthy gut?&nbsp;</h3>\n<p>For those of you who, like me, suffered from poor gut health for most of your life, you might not know what a healthy gut <em>is</em>. I certainly didn't. I remember when I was a catering cook, I was talking to a health-minded coworker who said \"Do you have much discomfort in your digestion?\", to which I replied \"not too much\", thinking I was relatively healthy in that respect. She said \"You shouldn't have any.\"</p>\n<p><br></p>\n<p>I took this as almost an affront. Who could not have any discomfort?&nbsp;</p>\n<p><br></p>\n<p>I remember watching a comedian talk about how he only discovered that his gut was unhealthy because he moved to a new apartment where his wife could hear him from the bathroom. He didn't know that he shouldn't have near-daily diarrhea!&nbsp;</p>\n<p><br></p>\n<p>Well I didn't know that I shouldn't be constantly wavering between diarrhea and constipation with maybe one or two healthy BM's in between. So let's make this as clear as can be:&nbsp;</p>\n<p><br></p>\n<p>With have a healthy gut, you should only get diarrhea when you have a stomach bug. You should experience no more than an infrequent, mild constipation that can be dealt with increasing fiber in your diet. And any kind of pain, gas and discomfort should be a rarity.&nbsp;</p>\n<p><br></p>\n<p>Many of you are may be thinking what I thought when I had that conversation with my coworker. How could that be? Am I really that far from good gut health? How could it have gotten this way? And how could I possibly get better, because that sounds like a <strong>much</strong> better life!!!!&nbsp;</p>\n<p><br></p>\n<h3>How to Heal Your Gut</h3>\n<p><br></p>\n<p>If you have IBS, LBS, or just plain angry guts that hate their life, there are 2 main things that need to happen:</p>\n<p><br></p>\n<ol>\n  <li>Eliminate foods that are doing damage.&nbsp;</li>\n  <li>Eat a healthy, balanced diet that encourages gut health.&nbsp;</li>\n</ol>\n<p><br></p>\n<p>People HATE the idea of giving up foods they love. People regularly joke about how sweets and other coveted treats are what make life worth living. Spoiler alert: they are not. And life with healthy digestion is much better than life without it.</p>\n<p><br></p>\n<p>Eliminating harmful foods is hard. Sometimes people will respond to a polite mention of a dietary restriction as if it's an affront to everything they believe in! \"You don't eat CHEESE???\"</p>\n<p><br></p>\n<p>In my journey to a healthy gut, and better life, I've given up gluten, most dairy (I can tolerate some low-lactose cheeses, and ghee), nightshades (oh how I miss French fries), I severely limit sugar intake, and I've given up on the idea that I can have more than one or two alcoholic drinks in a day. That's all permanent. Right now, I'm working on detoxifying my body to actually CURE my Fibromyalgia. That's right! Fibromyalgia is chronic acidosis. It can be cured. While I'm detoxing I'm eating almost entirely fruit, especially melons and berries.&nbsp;</p>\n<p><br></p>\n<p>And you know what? Life is not only still worth living, its a whole lot better. It's not always easy. When I have a fibro flare and feel like a giant is standing on me as I lie on a course gravel road, sometimes I want to cry at the fact that I cannot solace myself with a plate of mozzarella sticks or big bag of candy. But the fact is, I just can't. Not unless I want the pain to get twice as bad, or to spend the flare up on the toilet instead of in a (relatively) comfy bed. And since my detox started three weeks ago, I haven't had a single flare up and my pain is down!&nbsp;</p>\n<p><br></p>\n<p>One good way to find out what foods are not good for your body is <a href=\"https://wholelifenutrition.net/books/elimination-diet\">The Elimination Diet</a>. The idea is you eliminate ALL of the foods that people commonly have problems with, and reintroduce one every two weeks, and take careful stock of your gut's reaction.&nbsp;</p>\n<p><br></p>\n<p>This is how I found out I should eliminate gluten and dairy from my diet. But if you don't need a guidebook, just keep it simple. Reduce your diet down to just melons and berries, and then build back up slowly paying close attention to how your body reacts to each new food. This can also be a profound experience emotionally and even spiritually!&nbsp;</p>\n<p><br></p>\n<p><strong>Once you've figured out what to avoid, you want to figure out what to eat for a healthy, well balanced diet.&nbsp;</strong></p>\n<p><br></p>\n<p>There is no two ways around it, in our modern culture of fast food and packaged food, this is not easy either. Everyone is different and everyone's healthy diet that works for them is different. But for pretty much everyone Michael Pollan's adage that the key to a healthy diet is to \"Eat food, not too much, mostly plants\" is a great start. But that is for ALL people. For people like you and me with systemic acidosis causing pain throughout the body, we need to be stricter than that. For fibro patients it's more like \"Eat raw food, as much as you want, mostly melons and berries.\"</p>\n<p><br></p>\n<p>What about supplements? Well, some can be helpful, but be careful. There so much money being made on supplements that no one needs. Think in terms of eating fresh, living foods instead of powders. But some foods are so powerful they can be considered supplements. Aloe juice is soothing to the gut, and chia seeds aid in constipation. Moving further away from living foods, one of my favorite supplements for gut health is <a href=\"https://fibroclarity.com/items/14\">slippery elm bark</a>. <a href=\"https://agitated-sammet-4499d9.netlify.com/items/12\">probiotics</a> and <a href=\"https://agitated-sammet-4499d9.netlify.com/items/13\">prebiotics</a> can help you if your gut flora is depleted. If you have LBS, collagen can be supplemented to aide your digestive lining's repair. However, if you can stick to mostly raw, mostly fruit, mostly melons and berries, you probably don't need them. This sort of easy to digest, highly nutritious foods will help your body naturally heal itself!</p><p>Best of luck to you! If you'd like my help with this 1:1, I have <a href=\"https://agitated-sammet-4499d9.netlify.com/help\">a few time slots available</a> for coaching people through fixing their diet, as well as reorganizing their life around their health.&nbsp;</p>",
		"featuredImage": "http://www.beliefnet.com/columnists/depressionhelp/files/2017/02/berries-and-melons.jpg",
		"categories": [
			"Gut Health",
			"Quality of Life"
		],
		"citations": [
			"https://link.springer.com/article/10.1007/BF01300088"
		],
		"_id": "1"
	},
	{
		"timestamp": "2018-07-25T19:17:14.974Z",
		"title": "What Fibromyalgia REALLY Is",
		"content": "<p>Ever get a straight answer to this question from a mainstream medical doctor? I haven't. They don't seem to know. My experience in the United States was a 10 minute meeting in which no explanation was even attempted. They handed me pain meds and shooed me out the door. The pain meds did little more than give me further digestive problems.</p><p>Extremely frustrated, I sought the help of an \"expert\" doctor and a nutritionist. They helped me understand much of what was happening to cause me to feel the way I felt. I wasn't getting or processing enough nutrients. I was put on an expensive supplement regimen of things like Magnesium, B12, Fish Oil, etc. etc. to take for the rest of my life. But they still didn't answer my question: What IS it? Why do I have it in the first place? I'm a 34 year old, I should be in the prime of my life. Is this some sort of karmic punishment? What the heck is the cause???</p><p>Finally I found <a href=\"https://www.drmorsesherbalhealthclub.com\">Dr. Robert Morse's clinic</a> and learned the answer. SYSTEMIC ACIDOSIS. Which is (brace yourself) TOTALLY CURABLE!!!</p><p>The heck is systemic acidosis? It's beautifully simple. It means your body is full of acid. Why? Because your cells create waste when they function. They need to poop, and cells poop is acidic. Everybody poops, and everybody's cells eliminate waste as well. What creates systemic acidosis is when the body cannot transport that acidic waste to the eliminative organs to get it out of the body. What system is responsible for that? The Lymph System. The Lymph System is the \"other\" circulatory system. It's the sewage system! Blood brings good stuff in, lymph brings waste OUT. When that waste builds up, my god, if you are reading this, you KNOW it <em>hurts</em>. What we as fibro patients are primarily dealing with is stagnated lymph, and toxic bodies.</p><p>That's it. That's what we call Fibromyalgia really is, according to Dr. Morse. I'm not a medical expert, but I can tell you that since I've begun to look at it this way, and approach healing from this perspective, I've seen the greatest improvements I ever have.</p><p>How does one get rid systemic acidosis? Two simple things. </p>\n<ol>\n<li>Stop putting toxins into your body that the body must deal with.</li><li>Stimulate the lymph system and eliminative organs</li></ol></p><p>Dr. Morse recommends all natural self care products, a raw, mostly fruit diet, and a regimin or herbs. I haven't started on the herbs yet, but my drastic dietary change (including not taking the supplements anymore) so far has me feeling significantly better in only a few weeks. </p><p>So there you have it. That's what this horrible thing we are dealing with actually is. It's not arbitrary, and its curable through the incredibly non-invasive healing modalities of diet and herbs. To good to be true? It's possible, I'm only one person and Dr. Morse is only one doctor (albeit one with 40+ years of healing people). But if you have sought answers and found none, and sought solutions and got band aids, I can only encourage you to check out <a href=\"https://www.youtube.com/user/robertmorsend\">Dr. Morse's Youtube Channel</a> and see what you can learn. Explore this perspective and see for yourself if its too good to be true, or just incredibly good news for all of us. </p>",
		"featuredImage": "https://cdn1.dailyhealthpost.com/wp-content/uploads/2016/04/19-alkalize-body-fb-918x482.jpg",
		"categories": [
			"Big Picture",
			"Healing"
		],
		"citations": [
			"https://www.drmorsesherbalhealthclub.com"
		],
		"_id": "2"
	}
]