[
	{
		"timestamp": "2018-06-11T19:17:14.974Z",
		"title": "How to Heal Your Gut",
		"content": "<p>It's been a long road to a healthy gut for me, and one that fortunately has taken me to one of the largest health and quality of life improvements I've experienced in my life. On its own, gut health is incredibly important, as our ability to break down nutrients from our food is one of the pillars of our well being, along with a healthy heart, healthy mind, and healthy elimination. &nbsp;</p>\n<p><br></p>\n<p>Fibromyalgia is closely tied to Gut Health. In fact according to multiple sources, a majority of people with fibromyalgia also have Leaky Gut Syndrome, Irritable Bowel Syndrome, or at least chronic bowel discomfort.&nbsp;</p>\n<p><br></p>\n<p>While the mechanisms of cause and affect may not be well understood, two things are certain:&nbsp;</p>\n<p><br></p>\n<ol>\n  <li>Gut health is extremely important to overall health&nbsp;</li>\n  <li>Life is much improved with a healthy gut.&nbsp;</li>\n</ol>\n<h3>What is a healthy gut?&nbsp;</h3>\n<p>For those of you who, like me, suffered from poor gut health for most of your life, you might not know what a healthy gut <em>is</em>. I certainly didn't. I remember when I was a catering cook, I was talking to a health-minded coworker who said \"Do you have much discomfort in your digestion?\", to which I replied \"not too much\", thinking I was relatively healthy in that respect. She said \"You shouldn't have any.\"</p>\n<p><br></p>\n<p>I took this as almost an affront. Who could not have any discomfort?&nbsp;</p>\n<p><br></p>\n<p>I remember watching a comedian talk about how he only discovered that his gut was unhealthy because he moved to a new apartment where his wife could hear him from the bathroom. He didn't know that he shouldn't have near-daily diarrhea!&nbsp;</p>\n<p><br></p>\n<p>Well I didn't know that I shouldn't be constantly wavering between diarrhea and constipation with maybe one or two healthy BM's in between. So let's make this as clear as can be:&nbsp;</p>\n<p><br></p>\n<p>With have a healthy gut, you should only get diarrhea when you have a stomach bug. You should experience no more than an infrequent, mild constipation that can be dealt with increasing fiber in your diet. And any kind of pain, gas and discomfort should be a rarity.&nbsp;</p>\n<p><br></p>\n<p>Many of you are may be thinking what I thought when I had that conversation with my coworker. How could that be? Am I really that far from good gut health? How could it have gotten this way? And how could I possibly get better, because that sounds like a <strong>much</strong> better life!!!!&nbsp;</p>\n<p><br></p>\n<h3>How to Heal Your Gut</h3>\n<p><br></p>\n<p>If you have IBS, LBS, or just plain angry guts that hate their life, there are 2 main things that need to happen:</p>\n<p><br></p>\n<ol>\n  <li>Eliminate foods that are doing damage.&nbsp;</li>\n  <li>Eat a healthy, balanced diet that encourages gut health.&nbsp;</li>\n</ol>\n<p><br></p>\n<p>People HATE the idea of giving up foods they love. People regularly joke about how sweets and other coveted treats are what make life worth living. Spoiler alert: they are not. And life with healthy digestion is much better than life without it.</p>\n<p><br></p>\n<p>Eliminating harmful foods is hard. Sometimes people will respond to a polite mention of a dietary restriction as if it's an affront to everything they believe in! \"You don't eat CHEESE???\"</p>\n<p><br></p>\n<p>In my journey to a healthy gut, and better life, I've given up gluten, most dairy (I can tolerate some low-lactose cheeses, and ghee), nightshades (oh how I miss French fries), I severely limit sugar intake, and I've given up on the idea that I can have more than one or two alcoholic drinks in a day. That's all permanent. Right now, I'm working on detoxifying my body to actually CURE my Fibromyalgia. That's right! Fibromyalgia is chronic acidosis. It can be cured. While I'm detoxing I'm eating almost entirely fruit, especially melons and berries.&nbsp;</p>\n<p><br></p>\n<p>And you know what? Life is not only still worth living, its a whole lot better. It's not always easy. When I have a fibro flare and feel like a giant is standing on me as I lie on a course gravel road, sometimes I want to cry at the fact that I cannot solace myself with a plate of mozzarella sticks or big bag of candy. But the fact is, I just can't. Not unless I want the pain to get twice as bad, or to spend the flare up on the toilet instead of in a (relatively) comfy bed. And since my detox started three weeks ago, I haven't had a single flare up and my pain is down!&nbsp;</p>\n<p><br></p>\n<p>One good way to find out what foods are not good for your body is <a href=\"https://wholelifenutrition.net/books/elimination-diet\">The Elimination Diet</a>. The idea is you eliminate ALL of the foods that people commonly have problems with, and reintroduce one every two weeks, and take careful stock of your gut's reaction.&nbsp;</p>\n<p><br></p>\n<p>This is how I found out I should eliminate gluten and dairy from my diet. But if you don't need a guidebook, just keep it simple. Reduce your diet down to just melons and berries, and then build back up slowly paying close attention to how your body reacts to each new food. This can also be a profound experience emotionally and even spiritually!&nbsp;</p>\n<p><br></p>\n<p><strong>Once you've figured out what to avoid, you want to figure out what to eat for a healthy, well balanced diet.&nbsp;</strong></p>\n<p><br></p>\n<p>There is no two ways around it, in our modern culture of fast food and packaged food, this is not easy either. Everyone is different and everyone's healthy diet that works for them is different. But for pretty much everyone Michael Pollan's adage that the key to a healthy diet is to \"Eat food, not too much, mostly plants\" is a great start. But that is for ALL people. For people like you and me with systemic acidosis causing pain throughout the body, we need to be stricter than that. For fibro patients it's more like \"Eat raw food, as much as you want, mostly melons and berries.\"</p>\n<p><br></p>\n<p>What about supplements? Well, some can be helpful, but be careful. There so much money being made on supplements that no one needs. Think in terms of eating fresh, living foods instead of powders. But some foods are so powerful they can be considered supplements. Aloe juice is soothing to the gut, and chia seeds aid in constipation. Moving further away from living foods, one of my favorite supplements for gut health is <a href=\"https://fibroclarity.com/items/14\">slippery elm bark</a>. <a href=\"https://agitated-sammet-4499d9.netlify.com/items/12\">probiotics</a> and <a href=\"https://agitated-sammet-4499d9.netlify.com/items/13\">prebiotics</a> can help you if your gut flora is depleted. If you have LBS, collagen can be supplemented to aide your digestive lining's repair. However, if you can stick to mostly raw, mostly fruit, mostly melons and berries, you probably don't need them. This sort of easy to digest, highly nutritious foods will help your body naturally heal itself!</p><p>Best of luck to you! If you'd like my help with this 1:1, I have <a href=\"https://agitated-sammet-4499d9.netlify.com/help\">a few time slots available</a> for coaching people through fixing their diet, as well as reorganizing their life around their health.&nbsp;</p>",
		"featuredImage": "http://www.beliefnet.com/columnists/depressionhelp/files/2017/02/berries-and-melons.jpg",
		"categories": [
			"Gut Health",
			"Quality of Life"
		],
		"citations": [
			"https://link.springer.com/article/10.1007/BF01300088"
		],
		"_id": "1"
	},
	{
		"timestamp": "2018-07-25T19:17:14.974Z",
		"title": "What Fibromyalgia REALLY Is",
		"content": "<p>Ever get a straight answer to this question from a mainstream medical doctor? I haven't. They don't seem to know. My experience in the United States was a 10 minute meeting in which no explanation was even attempted. They handed me pain meds and shooed me out the door. The pain meds did little more than give me further digestive problems.</p><p>Extremely frustrated, I sought the help of an \"expert\" doctor and a nutritionist. They helped me understand much of what was happening to cause me to feel the way I felt. I wasn't getting or processing enough nutrients. I was put on an expensive supplement regimen of things like Magnesium, B12, Fish Oil, etc. etc. to take for the rest of my life. But they still didn't answer my question: What IS it? Why do I have it in the first place? I'm a 34 year old, I should be in the prime of my life. Is this some sort of karmic punishment? What the heck is the cause???</p><p>Finally I found <a href=\"https://www.drmorsesherbalhealthclub.com\">Dr. Robert Morse's clinic</a> and learned the answer. SYSTEMIC ACIDOSIS. Which is (brace yourself) TOTALLY CURABLE!!!</p><p>The heck is systemic acidosis? It's beautifully simple. It means your body is full of acid. Why? Because your cells create waste when they function. They need to poop, and cells poop is acidic. Everybody poops, and everybody's cells eliminate waste as well. What creates systemic acidosis is when the body cannot transport that acidic waste to the eliminative organs to get it out of the body. What system is responsible for that? The Lymph System. The Lymph System is the \"other\" circulatory system. It's the sewage system! Blood brings good stuff in, lymph brings waste OUT. When that waste builds up, my god, if you are reading this, you KNOW it <em>hurts</em>. What we as fibro patients are primarily dealing with is stagnated lymph, and toxic bodies.</p><p>That's it. That's what we call Fibromyalgia really is, according to Dr. Morse. I'm not a medical expert, but I can tell you that since I've begun to look at it this way, and approach healing from this perspective, I've seen the greatest improvements I ever have.</p><p>How does one get rid systemic acidosis? Two simple things. </p>\n<ol>\n<li>Stop putting toxins into your body that the body must deal with.</li><li>Stimulate the lymph system and eliminative organs</li></ol></p><p>Dr. Morse recommends all natural self care products, a raw, mostly fruit diet, and a regimin or herbs. I haven't started on the herbs yet, but my drastic dietary change (including not taking the supplements anymore) so far has me feeling significantly better in only a few weeks. </p><p>So there you have it. That's what this horrible thing we are dealing with actually is. It's not arbitrary, and its curable through the incredibly non-invasive healing modalities of diet and herbs. To good to be true? It's possible, I'm only one person and Dr. Morse is only one doctor (albeit one with 40+ years of healing people). But if you have sought answers and found none, and sought solutions and got band aids, I can only encourage you to check out <a href=\"https://www.youtube.com/user/robertmorsend\">Dr. Morse's Youtube Channel</a> and see what you can learn. Explore this perspective and see for yourself if its too good to be true, or just incredibly good news for all of us. </p>",
		"featuredImage": "https://cdn1.dailyhealthpost.com/wp-content/uploads/2016/04/19-alkalize-body-fb-918x482.jpg",
		"categories": [
			"Big Picture",
			"Healing"
		],
		"citations": [
			"https://www.drmorsesherbalhealthclub.com"
		],
		"_id": "2"
	},
	{
		"timestamp": "2018-08-6T19:17:14.974Z",
		"title": "7 Tips for Traveling with Fibromyalgia From an Experienced Traveler with Fibro",
		"content": "<p>Traveling can be hard on even a young healthy body, but just because we have fibromyalgia doesn't mean we should let ourselves be robbed of seeing the world! Traveling can be one of the most rewarding and enriching experiences in life. I've been doing a lot of traveling this year (I'm writing this from Mexico City!) and I've learned a thing or two about what's hard, what makes things easier, and what helps. This post is to help you plan your trip, and to encourage you to do so!</p><p>1. Food.</p><p>It's much harder to stay disciplined with one's diet while traveling and depending on where you go, it can be harder or easier to find the food that you want. I eat mostly fruit, and almost all raw. Traveling in Mexico is great for eating lots of fruit! It's very inexpensive, mostly organic, delicious and pretty much everywhere! But it still is harder to stick to the diet. For one thing, I want to taste the local cuisine!</p><p>Fortunately Mexico city is full of vegan restaurants! (Who knew?) But for the rest of Mexico, not so much. Since we are probably going to be more active than usual during a trip, we want our food to be serving us the best it can. To do this, do some research ahead. Learn about the local cuisine, use Google, Yelp, Trip Advisor etc. to find restaurants that might cater better to your diet, be it gluten-free, paleo, or raw.</p><p>Another thing that has helped me eat right while traveling is packing food. I'll go to the grocery store and buy a bunch of fruit, and put it in a couple of Tupperware containers. I pack a hand towel wrapped around a knife, spoon and fork, and I'm good to go. If you need, you can always get a little soft cooler and a couple of ice packs too.</p><p>2. Packing</p><p>Pack light. Please pack light. Right now I'm lugging around too much stuff and it is painful. (I really need a lighter laptop! This one is so heavy.) Don't pack too many clothes. You can hand-wash something in the sink and hang dry them. It's much better than lugging around a week or two of clothes when you feel like you just did six belly flops.</p><p>Prioritize the things that you do need. Do pack comfortable clothes, do pack your supplements or meds of course. But only pack what you need for the trip, and use small baggies that don't weigh much of anything and pack easily. No need to pack that giant bottle of fish oil.</p><p>3. Bedding and Lodging</p><p>This is a tough one. You can't always count on hotels to have comfortable mattresses, and AirBnBs are anyone's guess. However, if you ask, AirBnBs sometimes have amazing beds, and it's not always listed. If you book way ahead, you can have the pick of the litter, and ask all the questions you want. Ask if they have memory foam or otherwise a great mattress. A good night sleep is one of the most important things!</p><p>Other then a good bed, other things to prioritize are proximity to where you will be spending most of your time and a bathtub or hot tub (if a good soak does you good like it does me!)</p><p>4. The Travel Itself</p><p>How you travel matters a lot. You don't want to spend the beginning of your trip totally burnt from a 10-hour bus trip on uncomfortable seats. You may want to break up your trip into sections. Find something cool to do halfway to your destination and split up the trip. You will have less time in your destination, but you will have more energy to make the most of it.</p><p>Travel as comfortable as you can. Neck pillows, comfortable pants, and shoes, whatever helps don't skip it. Remember, delays happen. Even if you are planning on a three-hour plane ride, there might be 2 hours on either side of that. For those of us with Fibro, 7 hours is a long time to have extra discomfort on top of what is already there.</p><p>Don't assume you can't afford a more comfortable, fast, or convenient travel arrangement either! Depending on where you are, taxis might be quite cheap and you can skip the long walks! Also upgrading to a first-class bus ticket might be the matter of a couple of dollars, and provide you with a large reclining seat with a TV! Plane tickets might be inexpensive too, even first class ones, depending on where you are and what your budget is. </p><p>5. Recovering</p><p>When the activity starts feeling like its catching up to you, you are going to want a way to fully relax. I love to sit in a sauna, hot tub or steam room to sweat out some tension. This isn't always easy to find! But some research ahead of time can go a long way here too. Other recovery activities could include foot massages, full massages, pedicures, etc. Find some places ahead of time so if you are feeling burnt out all you have to do is cancel your plans and hop in a taxi.</p><p>6. What not to do</p><p>Even healthy people shouldn't try to see and do everything. Take it easy, enjoy and relax. Don't get caught up in crowds and seeing the things you are \"supposed\" to see. Prioritize what you are most excited about and just do that. Try to stay away from situations where there will be a lot of standing waiting in line. It's too brutal on our back and feet. Go during off times or find more off the beaten path things to do. But don't miss anything too dear to you! After all, you've gotten this far. See what you came to see.</p><p>Don't try to do too much in a day either. If you are traveling with others, don't be a hero so as not to be a burden. Ask for what you want and what you need. Let others go on without you if they want. If you need to sit down, say so. If you need a restaurant that serves food you can eat, say so! If you are worried how that might play out, you may want to consider other travel companions.</p><p>7. Have fun!</p><p>Most importantly, the thing that makes it all worth it. Have the best time you can! Just do it in a way that you won't be punished too much for afterward.</p><p>Happy travels!</p>",
		"featuredImage": "https://lh3.googleusercontent.com/Ec4yGSFqAWDWd5YaG8b11FSwq8TiK-0GCgRGuJB3GdkXjgd-uk63vYUojJ3gL4EHa8YgDPcK4je9DtOvp5h-JUh6LjrbVfqqyfadRZlYvyN_gRcMi7sBnjRt1rYJw88JcP1D5r_M4_bEQUwYiTj8_CT7cIlHxF1lxpUVSiyzc7PGxah13A1siExE86oX9vjpWF0f_wOp1oMkMzjtJr8MEFlU9L-y-v7xF0gdsruRA_6Fi5GvVMZmhq3cxqswkiy5Eznxny3KQe3rMMBiYx-JsIvebzKo1L42Wek8BUm-lsfWFpCdtCcFfi7cTP1jOU1fUPv6GzjWKEIYo3y7NL3SAQQEuCar2q2Zwr_oCZK2YW4Is7MXblDGtOV5IycLP0rjgA3qfAlac5jpPG4bmVfJpnPpgrp_9rxkbHAVMqYg_ukNxoXccfxifGS_j9ohw1WNL1ZabClS1rAJxuOrd-wghr2xXjrdqEzc6M6PPmPuZq7Bdm927yo6Pm2YrnRB5BkC4jE6cFBSFuWiTJV0SlB1EQYOo1E_CupbimSmbTf-j6nq8e0p-n88j0cIbN09CigXOPfLBIMrDj2i6KEea3UsJVQtfuEooC4xplruwbPnMmwsuB9E5ha6SCVRXRKmycg4tzvGijhDSLDnGNJpgOWpq-sXrzWXWvdBpw=w545-h727-no",
		"categories": [
			"Quality of Life",
			"Tips and Tricks"
		],
		"citations": [
			""
		],
		"_id": "3"
	},
	{
		"timestamp": "2018-08-20T19:17:14.974Z",
		"title": "I Don't Understand! 3 Ways to Deal With Doubting Family Members",
		"content": "<p>Chronic pain and fatigue are difficult to comprehend for people who feel good a majority of their days. This disconnection is why so many groups for people with Fibromyalgia share so many posts and memes about how no one understands. Because its true, hardly anyone really understands. Not even most of our doctors.</p><p>I recently had an issue with a couple of my family members because I shared that I was dry fasting at the recommendation of a Doctor. They decided my doctor must be a quack, and I must have lost my grip on reality. They expressed themselves out of concern for my health, but I've honestly never felt so dismissed by them. As if they know better about something they have only just heard about because I told them about it (dry fasting) better than I do, when I've been researching Fibromyalgia and what can help for over 2 years! As if their 2-minute video-based introduction to my doctor was enough to dismiss him as a quack, but of course other doctors that agree with them are to be treated as gospel! (Sorry, I'm still a little mad, if you can't tell.)</p><p>I know they mean well, and I think that most of it is that they simply cannot understand what we go through. My mother will sometimes make well-intended comments about me having a \"lazy morning\". Some of my best friends still don't understand that I'm not a picky eater or a health nut and that the reality is that if I ate that pizza I could end up between bed and the toilet for the rest of the night and possibly the next day.</p><p>I had one family member call into question my very sanity at the idea that I could have had Fibromyalgia as a child growing up. \"I don't remember hearing you complain\", she said. Why would I make that up? I do remember and I did complain. As a child, I was always told that it was \"growing pains\" or \"maybe a cramp\" or some other triviality I had no right to be complaining about. After having my pain dismissed as a child, having a family member dismiss my childhood pain again honestly really stung.</p><p>Regardless of how it might sting, our families and friends, and even doctors do not mean us any harm. They are simply ignorant of what its like to live with this illness. It doesn't occur to them that someone could suffer from daily, intense pain silently for years because it came on gradually and they hardly noticed it. They can't comprehend that someone who's seemed pretty fine could have been living with 7/10 pain day after day. They fall into the cultural traps of equating productivity with self-worth, and even the desperately antiquated idea that bad things happen to bad people. You can't be in terrible pain all of the time, you don't deserve it! And if you do, well, I don't want to know. </p><p>It's a harsh world out there. But fortunately how we feel emotionally is ultimately not up to the world out there. It's up to us. Here are some ways to prepare yourself for when people treat you as if your symptoms aren't real, you don't understand your own health, or that they know better than you do what's good for you:</p><p>1. Know your stuff and be confident in your knowledge</p><p>The reason this stuff hurts us is twofold: one is the distance we feel from the other person and the doubt that can arise within ourselves. Do I know what I'm doing? Am I crazy? We need to be able to answer these questions for ourselves with confidence. Not just to lessen the sting of when someone doubts us, but so we can proceed with as much confidence as you can down your healing path! I'll be the first to say it: this is not easy. Which is exactly why I made this site. You can use this as a resource for learning about Fibromyalgia, and always feel free to message me in the chat. If I'm near my phone, I'll help you the best I can.</p><p>2. Forgive them</p><p>Ultimately, we wouldn't want our loved ones to fully understand, would we? It would take them going through something similar. My wife understands me because of something incredibly hard she is continuing to go through health wise. I'm at the same time extremely grateful for a partner that never inadvertently hurts my feelings from a lack of understanding, and I wish she didn't understand and could have been spared her own pain. But that's the way it is.</p><p>With our family that doesn't get it, its because they have been spared. If they want to and make efforts to understand, they absolutely have your back! If they seem to have no interest in understanding at all, do what you can to forgive that too. And then think about what you want to share with them moving forward.</p><p>3. Stand your ground</p><p>You know your own body and own state of health better than anyone else. It's your responsibility to find healing modalities that work for you. It's you that has to live in your body for every day of this life. Don't let anyone cast doubt on what you are doing. If someone has constructive, research-based criticism of something you are doing, great. Listen to them, evaluate what they say, and decide how to proceed. But if someone is having a knee-jerk reaction to your dry fast plans or your high fruit diet, stand your ground. Let them know that you have done your research, and it's your body and you are going to do this.</p><p>While it still stings to be treated like we are ignorant by family, the three things above have helped me deal with a recent family situation without losing my cool with them, or doubting myself and my experience. It wasn't always that way. It took quite some time to learn to trust myself on things that no one else can confirm, like that I had fibro symptoms as a child.</p><p>We are like captains of ships on a difficult voyage, our healing voyage. We must all get to a place that rough seas, storms ahead, and negative comments from the deckhands do nothing to slow us down as we fight for our health and the lives we came here to live. </p><p>Best of luck to you! Please do hit me up in the chat if you could use some help, and please share this article if you know anyone else it might help. Thanks, and talk to you next week!</p>",
		"featuredImage": "https://c1.staticflickr.com/3/2907/14606052765_0f040990b6_b.jpg",
		"categories": [
			"Quality of Life",
			"Big Picture"
		],
		"citations": [
			""
		],
		"_id": "4"
	},
	{
		"timestamp": "2018-08-28T19:17:14.974Z",
		"title": "What is Kratom?",
		"content": "<p><p>You may have heard of something called Kratom in the news, especially if you live in the U.S. where the pharmaceutical industry is pushing to make this plant a schedule 1 banned substance, like meth and heroin. But right now it is completely legal, and so it should remain.</p><p>I use kratom and have benefitted hugely from it. I've also had terrible experiences with pharmaceutical drugs, so I'm just going to share my opinion outright in this blog than I'll share some information about it, and you can decide what you think for yourself.</p><p>My view is that the pharmaceutical industry has a monetary interest in the opioid epidemic getting worse, not better. Unfortunately, many of the people who rise to the top either have a blind spot for the huge ethical problems or they don't have ethics, to begin with.</p><p>Kratom represents a better path that they cannot patent (at least not without creating a GMO version a la Monsanto). The opioids in their pills were not invented but discovered in nature. Big pharma has followed the same despicable strategy for years: search nature for chemicals, synthesize and patent those chemicals, ban the plants they copied the chemicals from.</p><p>The result: people are scared away from better, natural remedies by the media, doctors, and even the police state. In the past few years, we've seen the mainstream do a complete 180 on the benefits of medical cannabis. We've seen numerous studies and articles exploring the health benefits of other schedule 1 substances, MDMA, psilocybin, and ayahuasca.</p><p>And yet, now in 2018, there is a push to put Kratom, a plant from Indonesia with remarkable pain relieving properties on the list of Schedule 1 banned substances, a list containing heroin and meth-amphetamines, a list supposed to be reserved for drugs with zero medical benefits and a high potential for abuse. SMH.</p><p>Kratom is an amazing plant medicine. I used to take Tramadol for pain daily, and kratom is equally effective and yet far less habit forming.</p><p>Tramadol is an opioid that is less addictive than many other opioids like morphine, and oxycodone. In fact, many doctors claim it isn't addictive at all under a certain dose. However, after taking it only a few months, well under that dose, I had serious withdrawal symptoms for several days when I quit it. I have at times taken kratom every day for months and experienced no withdrawals accept slight insomnia for a couple of days. I'd make the comparison that if Tramadol was a big line of cocaine every morning, kratom would be like having 2 cups of coffee instead.</p><p>There is a hubbub in the media about deaths associated with Kratom. There are a few. The FDA has released a list of 44 known kratom related deaths in total, however, this list is highly suspect. It includes someone who hanged themselves and someone who had 9 substances in their system to begin with. The Center for Disease Control, who doesn't answer to Big Pharma, only reported a single death between 2010-2015. But let's say that is true. <a href='https://www.sciencedirect.com/science/article/pii/S1752928X14000079'>Tramadol has 127 deaths associated with it. Just from 1996 to 2012. Just in Northern Ireland!!!</a></p><p>To put it in perspective another way, according to the above petition, \"Out of 323.1 million Americans only 263 calls were made to poison control centers while in 2014 energy drinks received 5,156 calls.\"</p><p>If you feel this is unjust and don't want people like me to be left without the best pain medicine I've found anywhere, please, please take a moment to sign <a href='https://www.change.org/p/food-and-drug-administration-fda-dea-keep-kratom-available?signed=true'>this petition</a> calling to keep it considered a dietary supplement. As I write this the petition is just shy of its goal of 25,000 signatures. Thank you!</p><h2>But what is it?</h2><p>OK, now that I've let you know about the injustice, let me get off my pedestal and share some info.</p><p>Kratom, or Mitragyna speciosa, is a vine that is native to Indonesia that has pain relieving and stimulating properties. It is traditionally used by chewing the leaves, for those purposes and also to stimulate appetite, as well as sexual desire, similar to how natives in Columbia chew coca leaves. In the last decade or so, it has become more popular around the globe to treat chronic pain, anxiety, opioid withdrawal, and even recreational use.</p><h2>Strains</h2><p>There are three main types of Kratom, and they have slightly different effects. Those strains are named for the color of the veins in the leaves, white, red, and green. White is the most stimulating, red is the most sedative, and green is in between. It should also be noted that in general, small doses tend to be stimulating, while large doses become more sedative. If I am taking kratom, I take green in the morning, and red at night. An evening dose might get a mix of both. I don't personally have much experience with the white but have read it tends to be less effective for pain than the other two.</p><h2>How do one consume kratom?</h2><p>Kratom comes in either dried leaf form, or much more commonly, powdered leaf, and is ingested by mouth. There are three main ways to consume it, putting it into capsules, \"toss and wash\", and making tea.</p><p>Toss an wash is when you simply stir the powder into some water or juice and throw it back. It is bitter and unpleasant, because this powder will not dissolve, so it tastes grainy. Hence the \"wash\" part, where you rinse your mouth afterward! A disadvantage of using capsules (other than how long it takes to make them) and toss and wash is that you end up ingesting all of the plant matter, and that can upset some people's stomach. For me, I get minor nausea and constipation when using it in this way.</p><p>Making tea is my favorite way. You do lose some of the potency but to me its worth it to have a happy stomach. You can make it any way you make tea, using tea bags, or dump it in loose and filter it through a cheesecloth (a coffee filter is too fine). My favorite method is to put it in a Bialetti stove top espresso maker, and than run it through a cheesecloth to remove the remaining plant matter. To minimize the loss in potency, squeeze some lemon, or put a dash of Apple Cider Vinegar in the water and on the powder. This helps to extract the good alkaloids. I also recommend steeping the kratom 2 or 3 times to get as much as you can out of it.</p><p>Over at <a href='https://www.instagram.com/fibroclarity/'>the Fibroclarity Instagram</a> page, you can find a recipe I came up with for a dairy free kratom mate latte! It's actually pretty tasty.</p><h2>What are the effects and side effects?</h2><p>The effects of kratom last 5-6 hours, are is similar to taking a painkiller like tramadol and drinking a cup of green tea.</p><p>Side effects may include:</p><ul><li>Pupillary constriction (tiny pupils).</li><li>Facial flushing (blushing).</li><li>Tremors or loss of motor coordination.</li><li>Constipation.</li><li>Sweating.</li><li>Dizziness.</li><li>Nausea and vomiting.</li><li>Itching.</li></ul><h2>Not to be taken lightly</h2><p>While kratom is far more safe than opiate medications prescribed by doctors, it is still a serious substance that needs to be respected. It can be abused, and can be addictive if used irresponsibly. It also can be dangerous if combined with other medication or drugs. Talk to your doctor before taking kratom if you are taking other medications or have any other conditions.</p><h2>Thank you kratom</h2><p>I keep kratom around to take when I'm getting flare-ups. Right now I'm recovering from getting wisdom teeth out, so I'm taking it daily. It's an absolute blessing. With pharmaceuticals, I've experienced terrible constipation, addiction, withdrawal, depression, lethargy, and stigma. With kratom, the depression and lethargy are nonexistent, and it's as if the other issues were turned from a 10 down to a 1.</p><p>This substance is a plant that grows on the earth naturally. It is my view that plants that come out of the earth, and whether we choose to put them in our bodies or not, is outside of the jurisdiction of any government.</p><p>I am very happy for the opportunity to share this information with you. Thank you for reading, and may your future be more pain-free than you ever thought possible.</p><p>Namaste.</p>",
		"featuredImage": "http://www.beliefnet.com/columnists/depressionhelp/files/2017/02/berries-and-melons.jpg",
		"categories": [
			"Pain Relief",
			"Natural Remedy"
		],
		"citations": [
			"https://www.change.org/p/food-and-drug-administration-fda-dea-keep-kratom-available?signed=true",
			"https://en.wikipedia.org/wiki/Mitragyna_speciosa#Detection_in_body_fluids",
			"https://www.kratomgardens.com/en/kratom-strains",
			"https://www.huffingtonpost.com.mx/entry/kratom-deaths-fda_us_5a7a3549e4b07af4e81eda8b",
			"https://www.sciencedirect.com/science/article/pii/S1752928X14000079"
		],
		"_id": "5"
	}
]